[
  {
    "_id": "67123943026c446087ff219d",
    "subject": "How do I reset my password?",
    "content": "To reset your password, follow these steps:\n1. Click on the 'Forgot Password' link on the login page.\n2. Enter the email address associated with your account.\n3. Check your email for a password reset link.\n4. Click the link and follow the instructions to create a new password.",
    "id": "a5f92cd9-4d68-4bd1-a8b1-447165c3724f"
  },
  {
    "_id": "67123a15026c446087ff219f",
    "id": "7c9e6679-7425-40de-944b-e07fc1f90ae7",
    "subject": "What payment methods do you accept?",
    "content": "We accept the following payment methods:\n- Credit cards (Visa, MasterCard, American Express)\n- PayPal\n- Bank transfers\n- Apple Pay and Google Pay (for mobile users)"
  },
  {
    "_id": "671248a4026c446087ff21a0",
    "id": "3fd85d6a-1c3e-4f0a-8c1f-84e1d3352d44",
    "subject": "How long does shipping take?",
    "content": "Shipping times vary depending on your location and chosen shipping method:\n- Standard shipping: 5-7 business days\n- Express shipping: 2-3 business days\n- International shipping: 7-14 business days\n\nPlease note that these are estimated times and may vary due to customs processing for international orders."
  },
  {
    "_id": "67535ec250de9605abdf0c9c",
    "id": "6fae0cda-ac7a-4922-b6b2-5e2fad96c087",
    "subject": "Kayleigh Paucek",
    "content": "Impedit delectus aperiam sunt perspiciatis. Earum fugiat ab reiciendis enim. Maiores repellat sapiente nesciunt doloremque tempore culpa fugiat blanditiis ullam.",
    "createdAt": "2024-12-06T20:29:54.235Z",
    "updatedAt": "2024-12-06T20:29:54.235Z",
    "__v": 0
  },
  {
    "_id": "67553809dd55443901a761cd",
    "id": "f48051df-93ad-48c1-8d6f-bcfaa2a55c31",
    "subject": "Vel quidem aut sapiente consequatur sequi officiis. ",
    "content": "Voluptate ea hic commodi recusandae reiciendis perspiciatis autem ea nobis. Id rerum eveniet corporis inventore mollitia quam architecto. Ipsa similique fugit libero. Voluptate rem voluptas quo ab impedit atque magnam odio. Voluptatum explicabo earum. Repudiandae similique quam qui animi debitis at odit. Incidunt aliquam in consectetur aspernatur nihil provident dicta a necessitatibus. Cum incidunt repellat suscipit commodi ipsum occaecati aliquam facere dolorem.",
    "createdAt": "2024-12-08T06:09:13.261Z",
    "updatedAt": "2024-12-08T06:09:13.261Z",
    "__v": 0
  },
  {
    "_id": "67556dd776eeffe485facc61",
    "id": "a7f66805-eb34-4681-bb07-cdb815ff2964",
    "subject": "Omnis excepturi voluptas.",
    "content": "Vero quas architecto autem distinctio ab consequatur natus. Occaecati reiciendis id veniam quos eaque quod consequatur. Ad magnam autem impedit numquam commodi.",
    "createdAt": "2024-12-08T09:58:47.404Z",
    "updatedAt": "2024-12-08T09:58:47.404Z",
    "__v": 0
  },
  {
    "_id": "6766bf045c699b9531514039",
    "id": "628680b7-a78e-4985-9d4c-88ad9be6bcb0",
    "subject": "Ratione magni repudiandae atque voluptatum praesentium magnam. ",
    "content": "Accusantium ipsam recusandae repellat deleniti voluptate quia mollitia. Veritatis quos ab sint voluptatem. Impedit eaque in impedit consequuntur odio saepe. Modi inventore quaerat saepe labore omnis. Autem iusto at et recusandae necessitatibus vitae vel. Esse totam unde voluptate dolore. Aperiam praesentium laudantium dolor velit illo occaecati vero. Illo a ab necessitatibus officiis aut architecto reprehenderit soluta itaque. Qui nam cum dolor. Incidunt laboriosam laborum velit exercitationem voluptate fugiat dolore inventore. Officiis sunt consectetur deleniti impedit libero velit vel adipisci.",
    "createdAt": "2024-12-21T13:13:40.410Z",
    "updatedAt": "2024-12-21T13:34:16.231Z",
    "__v": 0
  }
]